[
  {
    "id": "31:14",
    "surah_name": "Luqman",
    "verse_number": "14",
    "arabic": "وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ",
    "translation": "Dan Kami perintahkan kepada manusia (berbuat baik) kepada dua orang ibu-bapaknya; ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam dua tahun. Bersyukurlah kepada-Ku dan kepada dua orang ibu bapakmu, hanya kepada-Kulah kembalimu.",
    "themes": [
      "parenting",
      "family",
      "mother",
      "gratitude",
      "sacrifice",
      "children",
      "tired"
    ],
    "tafsir_summary": "Allah memerintahkan manusia untuk bersyukur kepada-Nya dan kepada kedua orang tua. Ibu menanggung beban kehamilan yang berat dan menyusui dua tahun penuh. Pengorbanan seorang ibu sangat besar dan diakui langsung oleh Allah."
  },
  {
    "id": "46:15",
    "surah_name": "Al-Ahqaf",
    "verse_number": "15",
    "arabic": "وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ إِحْسَانًا ۖ حَمَلَتْهُ أُمُّهُ كُرْهًا وَوَضَعَتْهُ كُرْهًا ۖ وَحَمْلُهُ وَفِصَالُهُ ثَلَاثُونَ شَهْرًا ۚ حَتَّىٰ إِذَا بَلَغَ أَشُدَّهُ وَبَلَغَ أَرْبَعِينَ سَنَةً قَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
    "translation": "Kami perintahkan kepada manusia supaya berbuat baik kepada dua orang ibu bapaknya, ibunya mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula). Mengandungnya sampai menyapihnya adalah tiga puluh bulan, sehingga apabila dia telah dewasa dan umurnya sampai empat puluh tahun ia berdoa: \"Ya Tuhanku, tunjukilah aku untuk mensyukuri nikmat Engkau yang telah Engkau berikan kepadaku dan kepada ibu bapakku dan supaya aku dapat berbuat amal yang saleh yang Engkau ridhai; berilah kebaikan kepadaku dengan (memberi kebaikan) kepada anak cucuku. Sesungguhnya aku bertaubat kepada Engkau dan sesungguhnya aku termasuk orang-orang yang berserah diri\".",
    "themes": [
      "parenting",
      "mother",
      "family",
      "sacrifice",
      "exhaustion",
      "tired",
      "patience",
      "children"
    ],
    "tafsir_summary": "Ayat ini menggambarkan perjuangan luar biasa seorang ibu — mengandung dengan susah payah dan melahirkan dengan susah payah. Allah mengakui beratnya pengorbanan ini secara eksplisit dan menjanjikan pahala bagi yang bersyukur dan bersabar."
  },
  {
    "id": "17:23",
    "surah_name": "Al-Isra",
    "verse_number": "23",
    "arabic": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا",
    "translation": "Dan Tuhanmu telah memerintahkan supaya kamu jangan menyembah selain Dia dan hendaklah kamu berbuat baik pada ibu bapakmu dengan sebaik-baiknya. Jika salah seorang di antara keduanya atau kedua-duanya sampai berumur lanjut dalam pemeliharaanmu, maka sekali-kali janganlah kamu mengatakan kepada keduanya perkataan \"ah\" dan janganlah kamu membentak mereka dan ucapkanlah kepada mereka perkataan yang mulia.",
    "themes": [
      "parenting",
      "family",
      "respect",
      "kindness",
      "duty",
      "parents"
    ],
    "tafsir_summary": "Allah memerintahkan untuk berbuat baik kepada orang tua. Jangan ucapkan kata kasar kepada mereka dan berbicaralah dengan mulia. Kewajiban ini disebutkan Allah tepat setelah larangan syirik — menunjukkan betapa tinggi kedudukannya."
  },
  {
    "id": "17:24",
    "surah_name": "Al-Isra",
    "verse_number": "24",
    "arabic": "وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
    "translation": "Dan rendahkanlah dirimu terhadap mereka berdua dengan penuh kesayangan dan ucapkanlah: \"Wahai Tuhanku, kasihilah mereka keduanya, sebagaimana mereka berdua telah mendidik aku waktu kecil\".",
    "themes": [
      "parenting",
      "family",
      "humility",
      "love",
      "prayer",
      "parents"
    ],
    "tafsir_summary": "Rendahkan dirimu kepada orang tua dengan penuh kasih sayang dan doakanlah mereka. Doa ini adalah bentuk balas budi paling tulus yang bisa diberikan seorang anak kepada orang tuanya."
  },
  {
    "id": "18:46",
    "surah_name": "Al-Kahfi",
    "verse_number": "46",
    "arabic": "الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَاةِ الدُّنْيَا ۖ وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا",
    "translation": "Harta dan anak-anak adalah perhiasan kehidupan dunia tetapi amalan-amalan yang kekal lagi saleh adalah lebih baik pahalanya di sisi Tuhanmu serta lebih baik untuk menjadi harapan.",
    "themes": [
      "parenting",
      "children",
      "perspective",
      "blessings",
      "world",
      "family"
    ],
    "tafsir_summary": "Harta dan anak-anak adalah perhiasan dunia yang sementara. Namun amal saleh yang kekal memiliki nilai jauh lebih tinggi di sisi Allah. Ini mengajarkan untuk melihat anak bukan sekadar kebanggaan, tapi amanah yang dipercayakan."
  },
  {
    "id": "64:15",
    "surah_name": "At-Taghabun",
    "verse_number": "15",
    "arabic": "إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ ۚ وَاللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ",
    "translation": "Sesungguhnya hartamu dan anak-anakmu hanyalah cobaan (bagimu), dan di sisi Allah-lah pahala yang besar.",
    "themes": [
      "parenting",
      "children",
      "trial",
      "patience",
      "family"
    ],
    "tafsir_summary": "Harta dan anak-anak adalah ujian. Memahami ini membantu orang tua untuk bersabar dalam mengasuh anak dengan penuh kesadaran — setiap kesulitan dalam merawat anak adalah ujian yang bernilai pahala di sisi Allah."
  },
  {
    "id": "2:233",
    "surah_name": "Al-Baqarah",
    "verse_number": "233",
    "arabic": "۞ وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَنْ يُتِمَّ الرَّضَاعَةَ ۚ وَعَلَى الْمَوْلُودِ لَهُ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ ۚ لَا تُكَلَّفُ نَفْسٌ إِلَّا وُسْعَهَا ۚ لَا تُضَارَّ وَالِدَةٌ بِوَلَدِهَا وَلَا مَوْلُودٌ لَهُ بِوَلَدِهِ ۚ وَعَلَى الْوَارِثِ مِثْلُ ذَٰلِكَ ۗ فَإِنْ أَرَادَا فِصَالًا عَنْ تَرَاضٍ مِنْهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيْهِمَا ۗ وَإِنْ أَرَدْتُمْ أَنْ تَسْتَرْضِعُوا أَوْلَادَكُمْ فَلَا جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُمْ مَا آتَيْتُمْ بِالْمَعْرُوفِ ۗ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ",
    "translation": "Para ibu hendaklah menyusukan anak-anaknya selama dua tahun penuh, yaitu bagi yang ingin menyempurnakan penyusuan. Dan kewajiban ayah memberi makan dan pakaian kepada para ibu dengan cara ma'ruf. Seseorang tidak dibebani melainkan menurut kadar kesanggupannya. Janganlah seorang ibu menderita kesengsaraan karena anaknya dan seorang ayah karena anaknya, dan warispun berkewajiban demikian. Apabila keduanya ingin menyapih (sebelum dua tahun) dengan kerelaan keduanya dan permusyawaratan, maka tidak ada dosa atas keduanya. Dan jika kamu ingin anakmu disusukan oleh orang lain, maka tidak ada dosa bagimu apabila kamu memberikan pembayaran menurut yang patut. Bertakwalah kamu kepada Allah dan ketahuilah bahwa Allah Maha Melihat apa yang kamu kerjakan.",
    "themes": [
      "parenting",
      "mother",
      "nursing",
      "family",
      "responsibility",
      "care",
      "children"
    ],
    "tafsir_summary": "Para ibu menyusui anaknya dua tahun penuh bagi yang ingin menyempurnakan penyusuan. Allah menetapkan tanggung jawab yang adil — ini adalah sistem yang Allah rancang untuk melindungi ibu yang kelelahan dan anak yang membutuhkan."
  },
  {
    "id": "66:6",
    "surah_name": "At-Tahrim",
    "verse_number": "6",
    "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا وَقُودُهَا النَّاسُ وَالْحِجَارَةُ عَلَيْهَا مَلَائِكَةٌ غِلَاظٌ شِدَادٌ لَا يَعْصُونَ اللَّهَ مَا أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ",
    "translation": "Hai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu; penjaganya malaikat-malaikat yang kasar, keras, dan tidak mendurhakai Allah terhadap apa yang diperintahkan-Nya kepada mereka dan selalu mengerjakan apa yang diperintahkan.",
    "themes": [
      "parenting",
      "family",
      "responsibility",
      "protection",
      "children"
    ],
    "tafsir_summary": "Jagalah dirimu dan keluargamu dari api neraka. Merawat dan mendidik anak bukan sekadar tugas duniawi — ia adalah ibadah dan amanah terbesar yang Allah percayakan kepada kita."
  },
  {
    "id": "28:7",
    "surah_name": "Al-Qashash",
    "verse_number": "7",
    "arabic": "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
    "translation": "Dan kami ilhamkan kepada ibu Musa; \"Susuilah dia, dan apabila kamu khawatir terhadapnya maka jatuhkanlah dia ke sungai (Nil). Dan janganlah kamu khawatir dan janganlah (pula) bersedih hati, karena sesungguhnya Kami akan mengembalikannya kepadamu, dan menjadikannya (salah seorang) dari para rasul.",
    "themes": [
      "parenting",
      "fear",
      "children",
      "comfort",
      "trust",
      "mother"
    ],
    "tafsir_summary": "Janganlah kamu takut dan jangan pula bersedih. Allah berjanji untuk mengembalikan dan menjadikannya salah seorang rasul. Bagi orang tua yang cemas akan keselamatan anaknya, Allah mengingatkan bahwa Dia menggenggam setiap anak dalam perlindungan-Nya."
  },
  {
    "id": "94:5",
    "surah_name": "Al-Insyirah",
    "verse_number": "5",
    "arabic": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "translation": "Karena sesungguhnya sesudah kesulitan itu ada kemudahan,",
    "themes": [
      "exhaustion",
      "hardship",
      "hope",
      "ease",
      "tired",
      "stress",
      "hopelessness",
      "grief"
    ],
    "tafsir_summary": "Sesungguhnya bersama kesulitan ada kemudahan. Janji Allah ini menegaskan bahwa kelelahan yang dirasakan sekarang tidaklah abadi — selalu ada jalan keluar yang menyertai setiap ujian."
  },
  {
    "id": "94:6",
    "surah_name": "Al-Insyirah",
    "verse_number": "6",
    "arabic": "إِنَّ مَعَ الْعُسْرِ يُسْرًا",
    "translation": "sesungguhnya sesudah kesulitan itu ada kemudahan.",
    "themes": [
      "exhaustion",
      "hardship",
      "hope",
      "ease",
      "tired",
      "stress"
    ],
    "tafsir_summary": "Allah mengulang janji ini dua kali berturut-turut untuk menegaskan kepastiannya. Kemudahan bukan sekadar harapan — ia adalah kepastian dari Allah Yang Maha Menepati Janji."
  },
  {
    "id": "2:286",
    "surah_name": "Al-Baqarah",
    "verse_number": "286",
    "arabic": "لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "translation": "Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Ia mendapat pahala (dari kebajikan) yang diusahakannya dan ia mendapat siksa (dari kejahatan) yang dikerjakannya. (Mereka berdoa): \"Ya Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami tersalah. Ya Tuhan kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang sebelum kami. Ya Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tak sanggup kami memikulnya. Beri maaflah kami; ampunilah kami; dan rahmatilah kami. Engkaulah Penolong kami, maka tolonglah kami terhadap kaum yang kafir\".",
    "themes": [
      "exhaustion",
      "burden",
      "capacity",
      "mercy",
      "stress",
      "anxiety",
      "overwhelming",
      "tired"
    ],
    "tafsir_summary": "Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Setiap beban yang terasa berat — Allah sudah menghitung bahwa kamu mampu menanggungnya. Ini bukan kebetulan."
  },
  {
    "id": "39:10",
    "surah_name": "Az-Zumar",
    "verse_number": "10",
    "arabic": "قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ",
    "translation": "Katakanlah: \"Hai hamba-hamba-Ku yang beriman. bertakwalah kepada Tuhanmu\". Orang-orang yang berbuat baik di dunia ini memperoleh kebaikan. Dan bumi Allah itu adalah luas. Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas.",
    "themes": [
      "exhaustion",
      "patience",
      "reward",
      "steadfast",
      "sacrifice",
      "tired"
    ],
    "tafsir_summary": "Hanya orang-orang yang bersabarlah yang dicukupkan pahala mereka tanpa batas. Setiap tetesan keringat dan usaha yang dilakukan dengan sabar dicatat Allah tanpa pengurangan sedikit pun."
  },
  {
    "id": "90:4",
    "surah_name": "Al-Balad",
    "verse_number": "4",
    "arabic": "لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي كَبَدٍ",
    "translation": "Sesungguhnya Kami telah menciptakan manusia berada dalam susah payah.",
    "themes": [
      "exhaustion",
      "hardship",
      "human",
      "struggle",
      "reality",
      "tired"
    ],
    "tafsir_summary": "Sungguh Kami telah menciptakan manusia dalam keadaan susah payah. Kelelahan dan perjuangan adalah bagian dari fitrah manusia — bukan tanda kegagalan, melainkan tanda bahwa kamu sedang hidup sepenuhnya."
  },
  {
    "id": "3:200",
    "surah_name": "Ali Imran",
    "verse_number": "200",
    "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اصْبِرُوا وَصَابِرُوا وَرَابِطُوا وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ",
    "translation": "Hai orang-orang yang beriman, bersabarlah kamu dan kuatkanlah kesabaranmu dan tetaplah bersiap siaga (di perbatasan negerimu) dan bertakwalah kepada Allah, supaya kamu beruntung.",
    "themes": [
      "exhaustion",
      "patience",
      "steadfast",
      "strength",
      "perseverance",
      "tired"
    ],
    "tafsir_summary": "Bersabarlah dan bertahanlah. Kesabaran bukan hanya diam menunggu — ia adalah keteguhan aktif untuk terus melangkah meski terasa berat, dan Allah bersama orang-orang yang bertahan."
  },
  {
    "id": "2:153",
    "surah_name": "Al-Baqarah",
    "verse_number": "153",
    "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ",
    "translation": "Hai orang-orang yang beriman, jadikanlah sabar dan shalat sebagai penolongmu, sesungguhnya Allah beserta orang-orang yang sabar.",
    "themes": [
      "exhaustion",
      "patience",
      "prayer",
      "help",
      "comfort",
      "tired",
      "stress"
    ],
    "tafsir_summary": "Mohonlah pertolongan dengan sabar dan shalat. Sesungguhnya Allah beserta orang-orang yang sabar. Dalam kelelahan, kembali kepada Allah adalah sumber kekuatan yang tidak pernah habis."
  },
  {
    "id": "2:155",
    "surah_name": "Al-Baqarah",
    "verse_number": "155",
    "arabic": "وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ",
    "translation": "Dan sungguh akan Kami berikan cobaan kepadamu, dengan sedikit ketakutan, kelaparan, kekurangan harta, jiwa dan buah-buahan. Dan berikanlah berita gembira kepada orang-orang yang sabar.",
    "themes": [
      "anxiety",
      "fear",
      "test",
      "patience",
      "hardship",
      "grief"
    ],
    "tafsir_summary": "Allah akan menguji dengan rasa takut, kelaparan, dan kekurangan harta. Ini bukan hukuman — ini seleksi untuk mengetahui siapa yang tetap beriman dan sabar di tengah kesulitan."
  },
  {
    "id": "2:156",
    "surah_name": "Al-Baqarah",
    "verse_number": "156",
    "arabic": "الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
    "translation": "(yaitu) orang-orang yang apabila ditimpa musibah, mereka mengucapkan: \"Inna lillaahi wa innaa ilaihi raaji'uun\".",
    "themes": [
      "anxiety",
      "grief",
      "loss",
      "acceptance",
      "surrender",
      "comfort"
    ],
    "tafsir_summary": "Orang-orang yang ketika ditimpa musibah berkata: Sesungguhnya kami milik Allah dan kepada-Nya kami kembali. Kalimat ini adalah penawar terbaik untuk hati yang gelisah dan tidak tenang."
  },
  {
    "id": "2:157",
    "surah_name": "Al-Baqarah",
    "verse_number": "157",
    "arabic": "أُولَٰئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَرَحْمَةٌ ۖ وَأُولَٰئِكَ هُمُ الْمُهْتَدُونَ",
    "translation": "Mereka itulah yang mendapat keberkatan yang sempurna dan rahmat dari Tuhan mereka dan mereka itulah orang-orang yang mendapat petunjuk.",
    "themes": [
      "anxiety",
      "grief",
      "comfort",
      "blessing",
      "mercy",
      "peace"
    ],
    "tafsir_summary": "Mereka itulah yang mendapat shalawat dari Tuhan mereka beserta rahmat. Ketenangan batin adalah hadiah Allah bagi yang berserah diri di tengah kepedihan dan kekhawatiran."
  },
  {
    "id": "57:22",
    "surah_name": "Al-Hadid",
    "verse_number": "22",
    "arabic": "مَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
    "translation": "Tiada suatu bencanapun yang menimpa di bumi dan (tidak pula) pada dirimu sendiri melainkan telah tertulis dalam kitab (Lauhul Mahfuzh) sebelum Kami menciptakannya. Sesungguhnya yang demikian itu adalah mudah bagi Allah.",
    "themes": [
      "anxiety",
      "control",
      "trust",
      "fate",
      "acceptance",
      "worry"
    ],
    "tafsir_summary": "Tidak ada musibah yang terjadi melainkan telah ada dalam kitab Allah sebelum diciptakan. Ini mengajarkan untuk tidak terlalu cemas atas hal-hal di luar kendali kita — semuanya sudah dalam rencana-Nya."
  },
  {
    "id": "65:3",
    "surah_name": "At-Talaq",
    "verse_number": "3",
    "arabic": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَنْ يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ ۚ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ ۚ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا",
    "translation": "Dan memberinya rezeki dari arah yang tiada disangka-sangkanya. Dan barangsiapa yang bertawakkal kepada Allah niscaya Allah akan mencukupkan (keperluan)nya. Sesungguhnya Allah melaksanakan urusan yang (dikehendaki)Nya. Sesungguhnya Allah telah mengadakan ketentuan bagi tiap-tiap sesuatu.",
    "themes": [
      "anxiety",
      "trust",
      "provision",
      "reliance",
      "stress",
      "financial",
      "worry"
    ],
    "tafsir_summary": "Barangsiapa bertawakal kepada Allah, maka Dia akan mencukupinya. Allah tidak akan membiarkan hamba-Nya yang berserah diri tanpa pertolongan dan jalan keluar."
  },
  {
    "id": "3:173",
    "surah_name": "Ali Imran",
    "verse_number": "173",
    "arabic": "الَّذِينَ قَالَ لَهُمُ النَّاسُ إِنَّ النَّاسَ قَدْ جَمَعُوا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ إِيمَانًا وَقَالُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "translation": "(Yaitu) orang-orang (yang mentaati Allah dan Rasul) yang kepada mereka ada orang-orang yang mengatakan: \"Sesungguhnya manusia telah mengumpulkan pasukan untuk menyerang kamu, karena itu takutlah kepada mereka\", maka perkataan itu menambah keimanan mereka dan mereka menjawab: \"Cukuplah Allah menjadi Penolong kami dan Allah adalah sebaik-baik Pelindung\".",
    "themes": [
      "anxiety",
      "courage",
      "faith",
      "trust",
      "sufficiency",
      "fear"
    ],
    "tafsir_summary": "Cukuplah Allah bagi kami, dan Dia adalah sebaik-baik pelindung. Ucapan ini adalah perisai dari segala kekhawatiran — menyerahkan segalanya kepada Yang Maha Kuasa."
  },
  {
    "id": "13:28",
    "surah_name": "Ar-Ra'd",
    "verse_number": "28",
    "arabic": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
    "translation": "(yaitu) orang-orang yang beriman dan hati mereka manjadi tenteram dengan mengingat Allah. Ingatlah, hanya dengan mengingati Allah-lah hati menjadi tenteram.",
    "themes": [
      "anxiety",
      "peace",
      "remembrance",
      "heart",
      "comfort",
      "stress",
      "lost"
    ],
    "tafsir_summary": "Ketahuilah, hanya dengan mengingat Allah hati menjadi tenteram. Ini adalah obat yang Allah sendiri resepkan untuk jiwa yang gelisah dan pikiran yang sulit tenang."
  },
  {
    "id": "39:53",
    "surah_name": "Az-Zumar",
    "verse_number": "53",
    "arabic": "۞ قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ",
    "translation": "Katakanlah: \"Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang.",
    "themes": [
      "hopelessness",
      "despair",
      "forgiveness",
      "mercy",
      "hope",
      "guilt"
    ],
    "tafsir_summary": "Janganlah berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni semua dosa. Seberapa jauh pun seseorang merasa tersesat, pintu Allah selalu terbuka lebar bagi yang mau kembali."
  },
  {
    "id": "15:56",
    "surah_name": "Al-Hijr",
    "verse_number": "56",
    "arabic": "قَالَ وَمَنْ يَقْنَطُ مِنْ رَحْمَةِ رَبِّهِ إِلَّا الضَّالُّونَ",
    "translation": "Ibrahim berkata: \"Tidak ada orang yang berputus asa dari rahmat Tuhan-nya, kecuali orang-orang yang sesat\".",
    "themes": [
      "hopelessness",
      "despair",
      "hope",
      "faith"
    ],
    "tafsir_summary": "Tidak ada yang berputus asa dari rahmat Tuhannya kecuali orang-orang yang sesat. Berputus asa dari Allah berarti melupakan betapa besar dan luasnya kasih sayang-Nya yang tanpa batas."
  },
  {
    "id": "12:87",
    "surah_name": "Yusuf",
    "verse_number": "87",
    "arabic": "يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِنْ يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِنْ رَوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِنْ رَوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
    "translation": "Hai anak-anakku, pergilah kamu, maka carilah berita tentang Yusuf dan saudaranya dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir\".",
    "themes": [
      "hopelessness",
      "despair",
      "hope",
      "trust",
      "patience"
    ],
    "tafsir_summary": "Janganlah berputus asa dari pertolongan Allah. Kisah Nabi Yusuf mengajarkan bahwa pertolongan Allah bisa datang kapan saja, dari arah yang paling tidak disangka, bahkan setelah bertahun-tahun."
  },
  {
    "id": "65:7",
    "surah_name": "At-Talaq",
    "verse_number": "7",
    "arabic": "لِيُنْفِقْ ذُو سَعَةٍ مِنْ سَعَتِهِ ۖ وَمَنْ قُدِرَ عَلَيْهِ رِزْقُهُ فَلْيُنْفِقْ مِمَّا آتَاهُ اللَّهُ ۚ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا ۚ سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا",
    "translation": "Hendaklah orang yang mampu memberi nafkah menurut kemampuannya. Dan orang yang disempitkan rezekinya hendaklah memberi nafkah dari harta yang diberikan Allah kepadanya. Allah tidak memikulkan beban kepada seseorang melainkan sekedar apa yang Allah berikan kepadanya. Allah kelak akan memberikan kelapangan sesudah kesempitan.",
    "themes": [
      "hopelessness",
      "ease",
      "hardship",
      "hope",
      "comfort"
    ],
    "tafsir_summary": "Allah akan memberikan kelapangan sesudah kesempitan. Tidak ada kesulitan yang kekal — Allah selalu menyiapkan jalan keluar bagi yang beriman dan tidak menyerah."
  },
  {
    "id": "21:87",
    "surah_name": "Al-Anbiya",
    "verse_number": "87",
    "arabic": "وَذَا النُّونِ إِذْ ذَهَبَ مُغَاضِبًا فَظَنَّ أَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنَادَىٰ فِي الظُّلُمَاتِ أَنْ لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "translation": "Dan (ingatlah kisah) Dzun Nun (Yunus), ketika ia pergi dalam keadaan marah, lalu ia menyangka bahwa Kami tidak akan mempersempitnya (menyulitkannya), maka ia menyeru dalam keadaan yang sangat gelap: \"Bahwa tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim\".",
    "themes": [
      "hopelessness",
      "guilt",
      "prayer",
      "rescue",
      "lost",
      "trapped"
    ],
    "tafsir_summary": "Doa Nabi Yunus dari dalam perut ikan: tidak ada Tuhan selain Engkau, Maha Suci Engkau, sesungguhnya aku termasuk orang yang zalim. Doa ini mengajarkan bahwa bahkan di titik paling gelap sekalipun, masih ada jalan keluar melalui pengakuan dan doa yang tulus."
  },
  {
    "id": "7:156",
    "surah_name": "Al-A'raf",
    "verse_number": "156",
    "arabic": "۞ وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ ۚ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاءُ ۖ وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ۚ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ",
    "translation": "Dan tetapkanlah untuk kami kebajikan di dunia ini dan di akhirat; sesungguhnya kami kembali (bertaubat) kepada Engkau. Allah berfirman: \"Siksa-Ku akan Kutimpakan kepada siapa yang Aku kehendaki dan rahmat-Ku meliputi segala sesuatu. Maka akan Aku tetapkan rahmat-Ku untuk orang-orang yang bertakwa, yang menunaikan zakat dan orang-orang yang beriman kepada ayat-ayat Kami\".",
    "themes": [
      "hopelessness",
      "mercy",
      "hope",
      "forgiveness",
      "compassion"
    ],
    "tafsir_summary": "Rahmat-Ku meliputi segala sesuatu. Tidak ada situasi yang benar-benar berada di luar jangkauan kasih sayang Allah. Luasnya rahmat Allah jauh melampaui segala kesalahan dan kelemahan manusia."
  },
  {
    "id": "2:186",
    "surah_name": "Al-Baqarah",
    "verse_number": "186",
    "arabic": "وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ",
    "translation": "Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka (jawablah), bahwasanya Aku adalah dekat. Aku mengabulkan permohonan orang yang berdoa apabila ia memohon kepada-Ku, maka hendaklah mereka itu memenuhi (segala perintah-Ku) dan hendaklah mereka beriman kepada-Ku, agar mereka selalu berada dalam kebenaran.",
    "themes": [
      "loneliness",
      "closeness",
      "prayer",
      "connection",
      "lost",
      "alone"
    ],
    "tafsir_summary": "Aku dekat. Aku mengabulkan permohonan orang yang berdoa apabila ia memohon kepada-Ku. Tidak ada yang benar-benar sendirian selama masih bisa berdoa — Allah selalu mendengar."
  },
  {
    "id": "50:16",
    "surah_name": "Qaf",
    "verse_number": "16",
    "arabic": "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ",
    "translation": "Dan sesungguhnya Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, dan Kami lebih dekat kepadanya daripada urat lehernya,",
    "themes": [
      "loneliness",
      "closeness",
      "seen",
      "known",
      "comfort",
      "alone"
    ],
    "tafsir_summary": "Kami lebih dekat kepadanya daripada urat lehernya sendiri. Tidak ada momen yang terlewatkan tanpa Allah mengetahuinya. Kamu tidak pernah benar-benar sendirian — Allah selalu hadir."
  },
  {
    "id": "9:40",
    "surah_name": "At-Taubah",
    "verse_number": "40",
    "arabic": "إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ",
    "translation": "Jikalau kamu tidak menolongnya (Muhammad) maka sesungguhnya Allah telah menolongnya (yaitu) ketika orang-orang kafir (musyrikin Mekah) mengeluarkannya (dari Mekah) sedang dia salah seorang dari dua orang ketika keduanya berada dalam gua, di waktu dia berkata kepada temannya: \"Janganlah kamu berduka cita, sesungguhnya Allah beserta kita\". Maka Allah menurunkan keterangan-Nya kepada (Muhammad) dan membantunya dengan tentara yang kamu tidak melihatnya, dan Al-Quran menjadikan orang-orang kafir itulah yang rendah. Dan kalimat Allah itulah yang tinggi. Allah Maha Perkasa lagi Maha Bijaksana.",
    "themes": [
      "loneliness",
      "comfort",
      "courage",
      "faith",
      "alone"
    ],
    "tafsir_summary": "Jangan bersedih, sesungguhnya Allah bersama kita. Kata-kata Nabi di saat paling sulit ini mengingatkan bahwa kehadiran Allah adalah ketenangan paling nyata di tengah kesepian."
  },
  {
    "id": "58:7",
    "surah_name": "Al-Mujadila",
    "verse_number": "7",
    "arabic": "أَلَمْ تَرَ أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ مَا يَكُونُ مِنْ نَجْوَىٰ ثَلَاثَةٍ إِلَّا هُوَ رَابِعُهُمْ وَلَا خَمْسَةٍ إِلَّا هُوَ سَادِسُهُمْ وَلَا أَدْنَىٰ مِنْ ذَٰلِكَ وَلَا أَكْثَرَ إِلَّا هُوَ مَعَهُمْ أَيْنَ مَا كَانُوا ۖ ثُمَّ يُنَبِّئُهُمْ بِمَا عَمِلُوا يَوْمَ الْقِيَامَةِ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
    "translation": "Tidakkah kamu perhatikan, bahwa sesungguhnya Allah mengetahui apa yang ada di langit dan di bumi? Tiada pembicaraan rahasia antara tiga orang, melainkan Dialah keempatnya. Dan tiada (pembicaraan antara) lima orang, melainkan Dialah keenamnya. Dan tiada (pula) pembicaraan antara jumlah yang kurang dari itu atau lebih banyak, melainkan Dia berada bersama mereka di manapun mereka berada. Kemudian Dia akan memberitahukan kepada mereka pada hari kiamat apa yang telah mereka kerjakan. Sesungguhnya Allah Maha mengetahui segala sesuatu.",
    "themes": [
      "loneliness",
      "presence",
      "awareness",
      "alone"
    ],
    "tafsir_summary": "Tidaklah ada pembicaraan rahasia antara tiga orang melainkan Dialah yang keempatnya. Allah selalu hadir dan tidak pernah absen dari setiap momen kehidupan kita, sesunyi apapun rasanya."
  },
  {
    "id": "20:46",
    "surah_name": "Taha",
    "verse_number": "46",
    "arabic": "قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ",
    "translation": "Allah berfirman: \"Janganlah kamu berdua khawatir, sesungguhnya Aku beserta kamu berdua, Aku mendengar dan melihat\".",
    "themes": [
      "loneliness",
      "fear",
      "comfort",
      "courage",
      "alone"
    ],
    "tafsir_summary": "Janganlah kamu berdua takut. Sesungguhnya Aku bersama kamu berdua; Aku mendengar dan melihat. Kata-kata Allah kepada Musa dan Harun ini adalah pengingat abadi bahwa Allah selalu menyaksikan dan menyertai."
  },
  {
    "id": "2:222",
    "surah_name": "Al-Baqarah",
    "verse_number": "222",
    "arabic": "وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ ۖ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ ۖ وَلَا تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ ۖ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّهُ ۚ إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ",
    "translation": "Mereka bertanya kepadamu tentang haidh. Katakanlah: \"Haidh itu adalah suatu kotoran\". Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh; dan janganlah kamu mendekati mereka, sebelum mereka suci. Apabila mereka telah suci, maka campurilah mereka itu di tempat yang diperintahkan Allah kepadamu. Sesungguhnya Allah menyukai orang-orang yang bertaubat dan menyukai orang-orang yang mensucikan diri.",
    "themes": [
      "guilt",
      "repentance",
      "love",
      "purification",
      "renewal"
    ],
    "tafsir_summary": "Allah mencintai orang-orang yang bertaubat dan mencintai orang-orang yang menyucikan diri. Taubat bukan tanda kelemahan — ia adalah tanda kecerdasan dan keberanian spiritual yang Allah cintai."
  },
  {
    "id": "66:8",
    "surah_name": "At-Tahrim",
    "verse_number": "8",
    "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَىٰ رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آمَنُوا مَعَهُ ۖ نُورُهُمْ يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
    "translation": "Hai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubatan nasuhaa (taubat yang semurni-murninya). Mudah-mudahan Rabbmu akan menutupi kesalahan-kesalahanmu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai, pada hari ketika Allah tidak menghinakan Nabi dan orang-orang mukmin yang bersama dia; sedang cahaya mereka memancar di hadapan dan di sebelah kanan mereka, sambil mereka mengatakan: \"Ya Rabb kami, sempurnakanlah bagi kami cahaya kami dan ampunilah kami; Sesungguhnya Engkau Maha Kuasa atas segala sesuatu\".",
    "themes": [
      "guilt",
      "repentance",
      "hope",
      "sincerity",
      "fresh start"
    ],
    "tafsir_summary": "Bertaubatlah kepada Allah dengan taubat yang sesungguhnya. Allah menjanjikan ampunan dan kebaikan bagi yang sungguh-sungguh kembali kepada-Nya dengan hati yang tulus."
  },
  {
    "id": "4:110",
    "surah_name": "An-Nisa",
    "verse_number": "110",
    "arabic": "وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّهَ يَجِدِ اللَّهَ غَفُورًا رَحِيمًا",
    "translation": "Dan barangsiapa yang mengerjakan kejahatan dan menganiaya dirinya, kemudian ia mohon ampun kepada Allah, niscaya ia mendapati Allah Maha Pengampun lagi Maha Penyayang.",
    "themes": [
      "guilt",
      "forgiveness",
      "mercy",
      "hope",
      "reassurance"
    ],
    "tafsir_summary": "Barangsiapa berbuat dosa kemudian memohon ampunan, niscaya dia mendapati Allah Maha Pengampun lagi Maha Penyayang. Tidak ada dosa yang membuat Allah menutup pintu ampunan bagi yang sungguh meminta."
  },
  {
    "id": "25:70",
    "surah_name": "Al-Furqan",
    "verse_number": "70",
    "arabic": "إِلَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَٰئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا",
    "translation": "kecuali orang-orang yang bertaubat, beriman dan mengerjakan amal saleh; maka itu kejahatan mereka diganti Allah dengan kebajikan. Dan adalah Allah maha Pengampun lagi Maha Penyayang.",
    "themes": [
      "guilt",
      "transformation",
      "hope",
      "mercy",
      "new beginning"
    ],
    "tafsir_summary": "Allah akan mengganti keburukan mereka dengan kebaikan. Kabar gembira ini menunjukkan bahwa setiap taubat yang tulus bisa menjadi awal dari lembaran baru yang lebih indah."
  },
  {
    "id": "1:6",
    "surah_name": "Al-Fatihah",
    "verse_number": "6",
    "arabic": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
    "translation": "Tunjukilah kami jalan yang lurus,",
    "themes": [
      "lost",
      "guidance",
      "direction",
      "clarity",
      "faith"
    ],
    "tafsir_summary": "Tunjukilah kami jalan yang lurus. Doa yang kita panjatkan paling tidak 17 kali sehari ini mengingatkan bahwa mencari arah dalam hidup adalah ibadah itu sendiri — dan Allah selalu menjawab."
  },
  {
    "id": "6:125",
    "surah_name": "Al-An'am",
    "verse_number": "125",
    "arabic": "فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ ۖ وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ ۚ كَذَٰلِكَ يَجْعَلُ اللَّهُ الرِّجْسَ عَلَى الَّذِينَ لَا يُؤْمِنُونَ",
    "translation": "Barangsiapa yang Allah menghendaki akan memberikan kepadanya petunjuk, niscaya Dia melapangkan dadanya untuk (memeluk agama) Islam. Dan barangsiapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki langit. Begitulah Allah menimpakan siksa kepada orang-orang yang tidak beriman.",
    "themes": [
      "lost",
      "guidance",
      "faith",
      "openness",
      "heart"
    ],
    "tafsir_summary": "Barangsiapa yang Allah kehendaki untuk diberi petunjuk, Allah lapangkan dadanya untuk Islam. Kelapangan hati dalam menerima kebenaran adalah tanda bahwa Allah sedang membimbing kita ke arah yang benar."
  },
  {
    "id": "94:1",
    "surah_name": "Al-Insyirah",
    "verse_number": "1",
    "arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ",
    "translation": "Bukankah Kami telah melapangkan untukmu dadamu?,",
    "themes": [
      "lost",
      "stress",
      "relief",
      "heart",
      "burden",
      "clarity"
    ],
    "tafsir_summary": "Bukankah Kami telah melapangkan dadamu? Pertanyaan ini adalah pengingat bahwa Allah sudah pernah melepaskan beban dari seseorang sebelumnya — dan Dia bisa melakukannya lagi untuk kita."
  },
  {
    "id": "3:134",
    "surah_name": "Ali Imran",
    "verse_number": "134",
    "arabic": "الَّذِينَ يُنْفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ ۗ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ",
    "translation": "(yaitu) orang-orang yang menafkahkan (hartanya), baik di waktu lapang maupun sempit, dan orang-orang yang menahan amarahnya dan memaafkan (kesalahan) orang. Allah menyukai orang-orang yang berbuat kebajikan.",
    "themes": [
      "anger",
      "patience",
      "forgiveness",
      "control",
      "character"
    ],
    "tafsir_summary": "Ciri orang yang bertakwa adalah menahan amarah dan memaafkan sesama manusia. Memaafkan bukan tanda kelemahan — ia adalah tanda kebesaran jiwa yang Allah cintai dan muliakan."
  },
  {
    "id": "42:43",
    "surah_name": "Asy-Syura",
    "verse_number": "43",
    "arabic": "وَلَمَنْ صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ",
    "translation": "Tetapi orang yang bersabar dan memaafkan, sesungguhnya (perbuatan) yang demikian itu termasuk hal-hal yang diutamakan.",
    "themes": [
      "anger",
      "patience",
      "forgiveness",
      "strength",
      "virtue"
    ],
    "tafsir_summary": "Barangsiapa yang bersabar dan memaafkan, sesungguhnya yang demikian itu termasuk hal yang memerlukan keteguhan hati. Mengendalikan amarah adalah prestasi batin yang Allah akui dan hargai."
  },
  {
    "id": "41:34",
    "surah_name": "Fushshilat",
    "verse_number": "34",
    "arabic": "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ",
    "translation": "Dan tidaklah sama kebaikan dan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, maka tiba-tiba orang yang antaramu dan antara dia ada permusuhan seolah-olah telah menjadi teman yang sangat setia.",
    "themes": [
      "anger",
      "kindness",
      "response",
      "character",
      "wisdom"
    ],
    "tafsir_summary": "Balaslah perbuatan buruk dengan yang lebih baik. Dengan begitu orang yang pernah bermusuhan denganmu akan menjadi seperti sahabat yang setia. Kebaikan adalah respon paling kuat terhadap kejahatan."
  },
  {
    "id": "7:199",
    "surah_name": "Al-A'raf",
    "verse_number": "199",
    "arabic": "خُذِ الْعَفْوَ وَأْمُرْ بِالْعُرْفِ وَأَعْرِضْ عَنِ الْجَاهِلِينَ",
    "translation": "Jadilah engkau pemaaf dan suruhlah orang mengerjakan yang ma'ruf, serta berpalinglah dari pada orang-orang yang bodoh.",
    "themes": [
      "anger",
      "patience",
      "tolerance",
      "wisdom",
      "practicality"
    ],
    "tafsir_summary": "Jadilah pemaaf, perintahkan kebaikan, dan berpalinglah dari orang-orang yang bodoh. Panduan praktis Allah untuk menghadapi situasi yang memancing emosi dengan kepala dingin."
  },
  {
    "id": "16:126",
    "surah_name": "An-Nahl",
    "verse_number": "126",
    "arabic": "وَإِنْ عَاقَبْتُمْ فَعَاقِبُوا بِمِثْلِ مَا عُوقِبْتُمْ بِهِ ۖ وَلَئِنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِلصَّابِرِينَ",
    "translation": "Dan jika kamu memberikan balasan, maka balaslah dengan balasan yang sama dengan siksaan yang ditimpakan kepadamu. Akan tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang-orang yang sabar.",
    "themes": [
      "anger",
      "patience",
      "endurance",
      "wisdom",
      "balance"
    ],
    "tafsir_summary": "Jika kamu membalas, maka balaslah setimpal. Namun jika kamu bersabar, itu lebih baik bagi orang-orang yang sabar. Kesabaran selalu memiliki nilai lebih dari sekadar keadilan."
  },
  {
    "id": "14:7",
    "surah_name": "Ibrahim",
    "verse_number": "7",
    "arabic": "وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ ۖ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ",
    "translation": "Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; \"Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu, dan jika kamu mengingkari (nikmat-Ku), maka sesungguhnya azab-Ku sangat pedih\".",
    "themes": [
      "gratitude",
      "blessings",
      "increase",
      "thankfulness",
      "abundance"
    ],
    "tafsir_summary": "Jika kamu bersyukur, sungguh Aku akan menambahkan nikmat kepadamu. Syukur bukan sekedar ucapan terima kasih — ia adalah kunci yang Allah sediakan untuk membuka pintu kelimpahan yang lebih besar."
  },
  {
    "id": "2:152",
    "surah_name": "Al-Baqarah",
    "verse_number": "152",
    "arabic": "فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ",
    "translation": "Karena itu, ingatlah kamu kepada-Ku niscaya Aku ingat (pula) kepadamu, dan bersyukurlah kepada-Ku, dan janganlah kamu mengingkari (nikmat)-Ku.",
    "themes": [
      "gratitude",
      "remembrance",
      "connection",
      "relationship",
      "thankfulness"
    ],
    "tafsir_summary": "Ingatlah Aku, niscaya Aku ingat pula kepadamu. Bersyukurlah kepada-Ku dan janganlah ingkar. Syukur adalah bentuk komunikasi paling tulus antara hamba dan Tuhannya."
  },
  {
    "id": "16:18",
    "surah_name": "An-Nahl",
    "verse_number": "18",
    "arabic": "وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ اللَّهَ لَغَفُورٌ رَحِيمٌ",
    "translation": "Dan jika kamu menghitung-hitung nikmat Allah, niscaya kamu tak dapat menentukan jumlahnya. Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang.",
    "themes": [
      "gratitude",
      "blessings",
      "abundance",
      "recognition",
      "perspective"
    ],
    "tafsir_summary": "Jika kamu mencoba menghitung nikmat Allah, niscaya kamu tidak akan sanggup menghitungnya. Undangan untuk mengalihkan fokus dari kekurangan kepada kelimpahan yang sebenarnya sudah ada."
  },
  {
    "id": "55:13",
    "surah_name": "Ar-Rahman",
    "verse_number": "13",
    "arabic": "فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ",
    "translation": "Maka nikmat Tuhan kamu yang manakah yang kamu dustakan?",
    "themes": [
      "gratitude",
      "blessings",
      "recognition",
      "awareness"
    ],
    "tafsir_summary": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan? Pertanyaan berulang ini adalah cara Allah mengajak kita benar-benar berhenti dan sadar akan betapa banyaknya yang sudah diberikan."
  },
  {
    "id": "93:11",
    "surah_name": "Ad-Duha",
    "verse_number": "11",
    "arabic": "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ",
    "translation": "Dan terhadap nikmat Tuhanmu, maka hendaklah kamu siarkan.",
    "themes": [
      "gratitude",
      "blessings",
      "expression",
      "sharing",
      "joy"
    ],
    "tafsir_summary": "Terhadap nikmat Tuhanmu, hendaklah kamu menyebut-nyebutnya. Mengekspresikan rasa syukur bukan sombong — itu adalah bentuk ibadah yang Allah perintahkan dan Allah ridhai."
  },
  {
    "id": "2:216",
    "surah_name": "Al-Baqarah",
    "verse_number": "216",
    "arabic": "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ ۖ وَعَسَىٰ أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ",
    "translation": "Diwajibkan atas kamu berperang, padahal berperang itu adalah sesuatu yang kamu benci. Boleh jadi kamu membenci sesuatu, padahal ia amat baik bagimu, dan boleh jadi (pula) kamu menyukai sesuatu, padahal ia amat buruk bagimu; Allah mengetahui, sedang kamu tidak mengetahui.",
    "themes": [
      "grief",
      "acceptance",
      "wisdom",
      "trust",
      "sadness",
      "disappointment"
    ],
    "tafsir_summary": "Boleh jadi kamu membenci sesuatu padahal ia amat baik bagimu. Dan boleh jadi kamu menyukai sesuatu padahal ia amat buruk bagimu. Allah Maha Mengetahui — sedang kamu tidak mengetahui."
  },
  {
    "id": "3:139",
    "surah_name": "Ali Imran",
    "verse_number": "139",
    "arabic": "وَلَا تَهِنُوا وَلَا تَحْزَنُوا وَأَنْتُمُ الْأَعْلَوْنَ إِنْ كُنْتُمْ مُؤْمِنِينَ",
    "translation": "Janganlah kamu bersikap lemah, dan janganlah (pula) kamu bersedih hati, padahal kamulah orang-orang yang paling tinggi (derajatnya), jika kamu orang-orang yang beriman.",
    "themes": [
      "grief",
      "strength",
      "hope",
      "faith",
      "sadness",
      "resilience"
    ],
    "tafsir_summary": "Janganlah kamu bersikap lemah dan jangan pula berduka cita. Padahal kamulah yang paling tinggi derajatnya jika kamu beriman. Iman adalah sumber kekuatan yang tidak pernah habis."
  },
  {
    "id": "4:32",
    "surah_name": "An-Nisa",
    "verse_number": "32",
    "arabic": "وَلَا تَتَمَنَّوْا مَا فَضَّلَ اللَّهُ بِهِ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِلرِّجَالِ نَصِيبٌ مِمَّا اكْتَسَبُوا ۖ وَلِلنِّسَاءِ نَصِيبٌ مِمَّا اكْتَسَبْنَ ۚ وَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ ۗ إِنَّ اللَّهَ كَانَ بِكُلِّ شَيْءٍ عَلِيمًا",
    "translation": "Dan janganlah kamu iri hati terhadap apa yang dikaruniakan Allah kepada sebahagian kamu lebih banyak dari sebahagian yang lain. (Karena) bagi orang laki-laki ada bahagian dari pada apa yang mereka usahakan, dan bagi para wanita (pun) ada bahagian dari apa yang mereka usahakan, dan mohonlah kepada Allah sebagian dari karunia-Nya. Sesungguhnya Allah Maha Mengetahui segala sesuatu.",
    "themes": [
      "jealousy",
      "envy",
      "contentment",
      "rizq",
      "acceptance"
    ],
    "tafsir_summary": "Janganlah kamu iri hati terhadap apa yang Allah karuniakan kepada sebagian yang lain. Setiap orang memiliki bagiannya yang sudah Allah tetapkan dengan adil dan penuh hikmah."
  },
  {
    "id": "2:148",
    "surah_name": "Al-Baqarah",
    "verse_number": "148",
    "arabic": "وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا ۖ فَاسْتَبِقُوا الْخَيْرَاتِ ۚ أَيْنَ مَا تَكُونُوا يَأْتِ بِكُمُ اللَّهُ جَمِيعًا ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
    "translation": "Dan bagi tiap-tiap umat ada kiblatnya (sendiri) yang ia menghadap kepadanya. Maka berlomba-lombalah (dalam membuat) kebaikan. Di mana saja kamu berada pasti Allah akan mengumpulkan kamu sekalian (pada hari kiamat). Sesungguhnya Allah Maha Kuasa atas segala sesuatu.",
    "themes": [
      "jealousy",
      "envy",
      "competition",
      "focus",
      "redirect"
    ],
    "tafsir_summary": "Setiap umat mempunyai kiblatnya. Maka berlomba-lombalah dalam berbuat kebaikan. Energi yang terpakai untuk iri lebih produktif jika dialihkan untuk berlomba dalam amal yang bermakna."
  },
  {
    "id": "16:71",
    "surah_name": "An-Nahl",
    "verse_number": "71",
    "arabic": "وَاللَّهُ فَضَّلَ بَعْضَكُمْ عَلَىٰ بَعْضٍ فِي الرِّزْقِ ۚ فَمَا الَّذِينَ فُضِّلُوا بِرَادِّي رِزْقِهِمْ عَلَىٰ مَا مَلَكَتْ أَيْمَانُهُمْ فَهُمْ فِيهِ سَوَاءٌ ۚ أَفَبِنِعْمَةِ اللَّهِ يَجْحَدُونَ",
    "translation": "Dan Allah melebihkan sebahagian kamu dari sebagian yang lain dalam hal rezeki, tetapi orang-orang yang dilebihkan (rezekinya itu) tidak mau memberikan rezeki mereka kepada budak-budak yang mereka miliki, agar mereka sama (merasakan) rezeki itu. Maka mengapa mereka mengingkari nikmat Allah?.",
    "themes": [
      "jealousy",
      "provision",
      "trust",
      "acceptance",
      "wisdom"
    ],
    "tafsir_summary": "Allah melebihkan sebagian kamu dari sebagian yang lain dalam rezeki. Perbedaan ini ada dalam rencana Allah yang penuh hikmah — bukan ketidakadilan yang perlu diratapi."
  },
  {
    "id": "11:6",
    "surah_name": "Hud",
    "verse_number": "6",
    "arabic": "۞ وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۚ كُلٌّ فِي كِتَابٍ مُبِينٍ",
    "translation": "Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya, dan Dia mengetahui tempat berdiam binatang itu dan tempat penyimpanannya. Semuanya tertulis dalam Kitab yang nyata (Lauh mahfuzh).",
    "themes": [
      "financial",
      "provision",
      "rizq",
      "trust",
      "certainty"
    ],
    "tafsir_summary": "Tidak ada makhluk yang merangkak di bumi kecuali Allah yang menanggung rezekinya. Kamu tidak sendirian menanggung beban finansial — Allah adalah penanggung rezeki yang sejati dan tidak pernah lalai."
  },
  {
    "id": "17:30",
    "surah_name": "Al-Isra",
    "verse_number": "30",
    "arabic": "إِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا",
    "translation": "Sesungguhnya Tuhanmu melapangkan rezeki kepada siapa yang Dia kehendaki dan menyempitkannya; sesungguhnya Dia Maha Mengetahui lagi Maha Melihat akan hamba-hamba-Nya.",
    "themes": [
      "financial",
      "provision",
      "rizq",
      "wisdom",
      "trust"
    ],
    "tafsir_summary": "Tuhanmu melapangkan rezeki bagi siapa yang Dia kehendaki dan menyempitkannya. Naik turunnya kondisi finansial ada dalam pengaturan Allah yang penuh hikmah dan kasih sayang."
  },
  {
    "id": "51:22",
    "surah_name": "Adz-Dzariyat",
    "verse_number": "22",
    "arabic": "وَفِي السَّمَاءِ رِزْقُكُمْ وَمَا تُوعَدُونَ",
    "translation": "Dan di langit terdapat (sebab-sebab) rezekimu dan terdapat (pula) apa yang dijanjikan kepadamu.",
    "themes": [
      "financial",
      "provision",
      "certainty",
      "trust",
      "rizq"
    ],
    "tafsir_summary": "Di langit ada rezekinya dan apa yang dijanjikan kepadamu. Rezekinya sudah ada di sana, sudah ditetapkan — tugasmu hanya berikhtiar dan bertawakal tanpa kehilangan harapan."
  },
  {
    "id": "30:21",
    "surah_name": "Ar-Rum",
    "verse_number": "21",
    "arabic": "وَمِنْ آيَاتِهِ أَنْ خَلَقَ لَكُمْ مِنْ أَنْفُسِكُمْ أَزْوَاجًا لِتَسْكُنُوا إِلَيْهَا وَجَعَلَ بَيْنَكُمْ مَوَدَّةً وَرَحْمَةً ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ",
    "translation": "Dan di antara tanda-tanda kekuasaan-Nya ialah Dia menciptakan untukmu isteri-isteri dari jenismu sendiri, supaya kamu cenderung dan merasa tenteram kepadanya, dan dijadikan-Nya diantaramu rasa kasih dan sayang. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang berfikir.",
    "themes": [
      "marriage",
      "relationship",
      "love",
      "mercy",
      "companionship",
      "family"
    ],
    "tafsir_summary": "Di antara tanda-tanda kekuasaan-Nya Dia menciptakan bagimu pasangan hidup agar kamu cenderung dan tenteram kepadanya, dan dijadikan-Nya rasa kasih dan sayang di antara kamu. Cinta dalam pernikahan adalah ayat Allah yang nyata."
  },
  {
    "id": "2:187",
    "surah_name": "Al-Baqarah",
    "verse_number": "187",
    "arabic": "أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَىٰ نِسَائِكُمْ ۚ هُنَّ لِبَاسٌ لَكُمْ وَأَنْتُمْ لِبَاسٌ لَهُنَّ ۗ عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ ۖ فَالْآنَ بَاشِرُوهُنَّ وَابْتَغُوا مَا كَتَبَ اللَّهُ لَكُمْ ۚ وَكُلُوا وَاشْرَبُوا حَتَّىٰ يَتَبَيَّنَ لَكُمُ الْخَيْطُ الْأَبْيَضُ مِنَ الْخَيْطِ الْأَسْوَدِ مِنَ الْفَجْرِ ۖ ثُمَّ أَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ ۚ وَلَا تُبَاشِرُوهُنَّ وَأَنْتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ ۗ تِلْكَ حُدُودُ اللَّهِ فَلَا تَقْرَبُوهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ",
    "translation": "Dihalalkan bagi kamu pada malam hari bulan puasa bercampur dengan isteri-isteri kamu; mereka adalah pakaian bagimu, dan kamupun adalah pakaian bagi mereka. Allah mengetahui bahwasanya kamu tidak dapat menahan nafsumu, karena itu Allah mengampuni kamu dan memberi maaf kepadamu. Maka sekarang campurilah mereka dan ikutilah apa yang telah ditetapkan Allah untukmu, dan makan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu fajar. Kemudian sempurnakanlah puasa itu sampai (datang) malam, (tetapi) janganlah kamu campuri mereka itu, sedang kamu beri'tikaf dalam mesjid. Itulah larangan Allah, maka janganlah kamu mendekatinya. Demikianlah Allah menerangkan ayat-ayat-Nya kepada manusia, supaya mereka bertakwa.",
    "themes": [
      "marriage",
      "relationship",
      "intimacy",
      "companionship",
      "protection"
    ],
    "tafsir_summary": "Mereka adalah pakaian bagimu dan kamu adalah pakaian bagi mereka. Gambaran pakaian ini menyiratkan perlindungan, kehangatan, dan keintiman yang Allah kehendaki dalam pernikahan."
  },
  {
    "id": "4:19",
    "surah_name": "An-Nisa",
    "verse_number": "19",
    "arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا ۖ وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ۚ وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ ۚ فَإِنْ كَرِهْتُمُوهُنَّ فَعَسَىٰ أَنْ تَكْرَهُوا شَيْئًا وَيَجْعَلَ اللَّهُ فِيهِ خَيْرًا كَثِيرًا",
    "translation": "Hai orang-orang yang beriman, tidak halal bagi kamu mempusakai wanita dengan jalan paksa dan janganlah kamu menyusahkan mereka karena hendak mengambil kembali sebagian dari apa yang telah kamu berikan kepadanya, terkecuali bila mereka melakukan pekerjaan keji yang nyata. Dan bergaullah dengan mereka secara patut. Kemudian bila kamu tidak menyukai mereka, (maka bersabarlah) karena mungkin kamu tidak menyukai sesuatu, padahal Allah menjadikan padanya kebaikan yang banyak.",
    "themes": [
      "marriage",
      "relationship",
      "kindness",
      "respect",
      "patience"
    ],
    "tafsir_summary": "Pergaulilah mereka dengan cara yang patut. Jika kamu tidak menyukai mereka, boleh jadi kamu tidak menyukai sesuatu padahal Allah menjadikan padanya kebaikan yang banyak."
  },
  {
    "id": "26:80",
    "surah_name": "Asy-Syu'ara",
    "verse_number": "80",
    "arabic": "وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ",
    "translation": "dan apabila aku sakit, Dialah Yang menyembuhkan aku,",
    "themes": [
      "health",
      "illness",
      "healing",
      "trust",
      "hope",
      "surrender"
    ],
    "tafsir_summary": "Dan apabila aku sakit, Dialah yang menyembuhkan aku. Sakit bukan akhir dari segalanya — dan kesembuhan ada di tangan Allah Al-Syafi, Sang Maha Penyembuh yang tidak pernah gagal."
  },
  {
    "id": "10:57",
    "surah_name": "Yunus",
    "verse_number": "57",
    "arabic": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُمْ مَوْعِظَةٌ مِنْ رَبِّكُمْ وَشِفَاءٌ لِمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِلْمُؤْمِنِينَ",
    "translation": "Hai manusia, sesungguhnya telah datang kepadamu pelajaran dari Tuhanmu dan penyembuh bagi penyakit-penyakit (yang berada) dalam dada dan petunjuk serta rahmat bagi orang-orang yang beriman.",
    "themes": [
      "health",
      "guidance",
      "healing",
      "heart",
      "comfort",
      "hope"
    ],
    "tafsir_summary": "Wahai manusia, sungguh telah datang kepadamu pelajaran dari Tuhanmu dan penyembuh bagi penyakit dalam dada. Al-Quran sendiri adalah obat — bukan hanya untuk tubuh, tapi terutama untuk jiwa."
  }
]